arror1784/ESP32-audioI2S/src/Audio.cpp
        if(indexOf(pl, "Content-Type:", 0)){
            f_ct = true;                                        // found ContentType in pl
        }

        if(indexOf(pl, "content-type:", 0)){
            f_ct = true;                                        // found ContentType in pl
        }

        if((indexOf(pl, "Connection:close", 0) >= 0) && !f_ct){ // #193 is not a playlist if no ct found
            m_datamode = AUDIO_HEADER;
        }

        int pos = indexOf(pl, "400 Bad Request", 0);
        if(pos >= 0) {
            m_datamode = AUDIO_NONE;
            if(audio_info) audio_info("Error 400 Bad Request");
            stopSong();
            return;
        }

        pos = indexOf(pl, "404 Not Found", 0);
        if(pos >= 0) {
            m_datamode = AUDIO_NONE;
            if(audio_info) audio_info("Error 404 Not Found");
            stopSong();
            return;
        }

        pos = indexOf(pl, "404 File Not Found", 0);
        if(pos >= 0) {
            m_datamode = AUDIO_NONE;
            if(audio_info) audio_info("Error 404 File Not Found");
            stopSong();
            return;
        }

        pos = indexOf(pl, "HTTP/1.0 404", 0);
        if(pos >= 0) {
            m_datamode = AUDIO_NONE;
            if(audio_info) audio_info("Error 404 Not Available");
            stopSong();
            return;
        }

        pos = indexOf(pl, "HTTP/1.1 401", 0);
        if(pos >= 0) {
            m_datamode = AUDIO_NONE;
            if(audio_info) audio_info("Error 401 Unauthorized");
            stopSong();
            return;
        }

        pos = indexOf(pl, "HTTP/1.1 403", 0);
        if(pos >= 0) {
            m_datamode = AUDIO_NONE;
            if(audio_info) audio_info("Error 403 Forbidden");
            stopSong();
            return;
        }

        pos = indexOf(pl, ":", 0);                          // lowercase all letters up to the colon
        if(pos >= 0) {
            for(int i=0; i < pos; i++) {
                pl[i] = toLowerCase(pl[i]);
            }
        }

        if(startsWith(pl, "icy-")){                         // icy-data in playlist? that can not be
            m_datamode = AUDIO_HEADER;
            if(audio_info) audio_info("playlist is not valid, switch to AUDIO_HEADER");
            return;
        }


        if(startsWith(pl, "location:") || startsWith(pl, "Location:")) {
            char* host;
            pos = indexOf(pl, "http", 0);
            host = (pl + pos);
//            sprintf(chbuf, "redirect to new host %s", host);
//            if(m_f_Log) if(audio_info) audio_info(chbuf);
            pos = indexOf(pl, "/", 10);
            if(strncmp(host, m_lastHost, pos) == 0){                                    // same host?
                _client->stop(); _client->flush();
                httpPrint(host);
            }
            else connecttohost(host);                                                   // different host,
        }
        return;
    } // end AUDIO_PLAYLISTHEADER

    // - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
    if(m_datamode == AUDIO_PLAYLISTDATA) {                  // Read next byte of .m3u file data
        if(m_f_Log) { AUDIO_INFO(sprintf(chbuf, "Playlistdata: %s", pl);) }   // Show playlistdata

        pos = indexOf(pl, "<!DOCTYPE", 0);                  // webpage found
        if(pos >= 0) {
            m_datamode = AUDIO_NONE;
            if(audio_info) audio_info("Not Found");
            stopSong();
            return;
        }

        // - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
        if(m_playlistFormat == FORMAT_M3U) {

            if(!f_begin) f_begin = true;                    // first playlistdata received
            if(indexOf(pl, "#EXTINF:", 0) >= 0) {           // Info?
               pos = indexOf(pl, ",", 0);                   // Comma in this line?
               if(pos > 0) {
                   // Show artist and title if present in metadata
                   if(audio_info) audio_info(pl + pos + 1);
               }
               return;
           }
           if(startsWith(pl, "#")) {                        // Commentline?
               return;
           }

           pos = indexOf(pl, "http://:@", 0); // ":@"??  remove that!
           if(pos >= 0) {
               AUDIO_INFO(sprintf(chbuf, "Entry in playlist found: %s", (pl + pos + 9));)
               connecttohost(pl + pos + 9);
               return;
           }
           //sprintf(chbuf, "Entry in playlist found: %s", pl);
           //if(audio_info) audio_info(chbuf);
           pos = indexOf(pl, "http", 0);                    // Search for "http"
           const char* host;
           if(pos >= 0) {                                   // Does URL contain "http://"?
               host = (pl + pos);
               connecttohost(host);
           }                                                // Yes, set new host
           return;
        } //m3u

        // - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
        if(m_playlistFormat == FORMAT_PLS) {

            if(!f_begin){
                if(strlen(pl) == 0) return;                 // empty line
                if(strcmp(pl, "[playlist]") == 0){          // first entry in valid pls
                    f_begin = true;                         // we have first playlistdata received
                    return;
                }
                else{
                    m_datamode = AUDIO_HEADER;                // pls is not valid
                    if(audio_info) audio_info("pls is not valid, switch to AUDIO_HEADER");
                    return;
                }
            }

            if(startsWith(pl, "File1")) {
                pos = indexOf(pl, "http", 0);                   // File1=http://streamplus30.leonex.de:14840/;
                if(pos >= 0) {                                  // yes, URL contains "http"?
                    memcpy(m_lastHost, pl + pos, strlen(pl) + 1);   // http://streamplus30.leonex.de:14840/;
                    // Now we have an URL for a stream in host.
                    f_ref = true;
                }
            }
            if(startsWith(pl, "Title1")) {                      // Title1=Antenne Tirol
                const char* plsStationName = (pl + 7);
                if(audio_showstation) audio_showstation(plsStationName);
                AUDIO_INFO(sprintf(chbuf, "StationName: \"%s\"", plsStationName);)
                f_title = true;
            }
            if(startsWith(pl, "Length1")) f_title = true;               // if no Title is available
            if((f_ref == true) && (strlen(pl) == 0)) f_title = true;

